## Import Data

In [19]:
import pandas as pd
sales = pd.read_excel('https://github.com/datagy/mediumdata/raw/master/pythonexcel.xlsx', sheet_name = 'sales')
states = pd.read_excel('https://github.com/datagy/mediumdata/raw/master/pythonexcel.xlsx', sheet_name = 'states')

## Printing the first five rows

In [23]:
print(sales.head())

    Product  Sales       Date           City MoreThan500
0   Bananas    121 2019-06-13        Atlanta          No
1   Bananas    236 2019-10-20        Atlanta          No
2    Apples    981 2019-03-12        Atlanta         Yes
3     Bread    996 2019-07-28  New York City         Yes
4  Brocolli    790 2019-10-22  New York City         Yes

## If function in Pandas

In [21]:
sales['MoreThan500'] = ['Yes' if x > 500 else 'No' for x in sales['Sales']]

## VLOOKUP

In [13]:
sales.head()

    Product  Sales       Date           City MoreThan500
0   Bananas    121 2019-06-13        Atlanta          No
1   Bananas    236 2019-10-20        Atlanta          No
2    Apples    981 2019-03-12        Atlanta         Yes
3     Bread    996 2019-07-28  New York City         Yes
4  Brocolli    790 2019-10-22  New York City         Yes

In [15]:
sales = pd.merge(sales, states, how='left', on='City')

In [16]:
sales.head()

    Product  Sales       Date           City MoreThan500   State_x   State_y
0   Bananas    121 2019-06-13        Atlanta          No   Georgia   Georgia
1   Bananas    236 2019-10-20        Atlanta          No   Georgia   Georgia
2    Apples    981 2019-03-12        Atlanta         Yes   Georgia   Georgia
3     Bread    996 2019-07-28  New York City         Yes  New York  New York
4  Brocolli    790 2019-10-22  New York City         Yes  New York  New York

## Pivot Tables

In [17]:
sales.pivot_table(index = 'City', values = 'Sales', aggfunc = 'sum')

               Sales
City
Atlanta         7642
New York City   8249
Portland        4231
Toronto         9571